app/views/books/_table.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---

    <td>コメント数:<%= book.book_comments.count  %></td>