app/controllers/books_controller.rb

  def index
    @books = Book.all
    @book = Book.new
    @user = User.find(current_user.id)
---
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
    redirect_to book_path(@book.id)
    else
      @user = User.find(current_user.id)
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaaa"], ["body", "aaaaaaa"], ["user_id", 9], ["created_at", "2021-01-10 02:53:04.293084"], ["updated_at", "2021-01-10 02:53:04.293084"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "books".* FROM "books"