app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "tetst"], ["user_id", 11], ["book_id", 2], ["created_at", "2021-01-12 13:39:34.573107"], ["updated_at", "2021-01-12 13:39:34.573107"]]
---
  def create
    @book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 22]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 22], ["book_id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
    @book = Book.find(params[:book_id])